## Selecionando colunas e filtrando linhas
### Selecionando colunas

In [3]:
import pandas as pd

data = {'Nome': ['Adriano', 'Rodrigo', 'Juliano', 'Mateus', 'Luiza', 'Rodrigo', 'Ayres', 'Aninha'],
		'Sobrenome': ['Soares', 'Tadewald', 'Faccioni', 'Kienzle', 'Cherobini', 'Vanzelotti', 'Júnior', 'Tadewald'],
		'Idade Atual': [31, 31, 25, 35, 22, 21, 28, 20],
		}

df = pd.DataFrame(data)
df.Sobrenome # No
df['Sobrenome'] # Yes

0        Soares
1      Tadewald
2      Faccioni
3       Kienzle
4     Cherobini
5    Vanzelotti
6        Júnior
7      Tadewald
Name: Sobrenome, dtype: object

In [4]:
type(df['Sobrenome'])

pandas.core.series.Series

In [5]:
type(df[['Sobrenome']])

pandas.core.frame.DataFrame

In [6]:
df[['Sobrenome', 'Idade Atual']]

    Sobrenome  Idade Atual
0      Soares           31
1    Tadewald           31
2    Faccioni           25
3     Kienzle           35
4   Cherobini           22
5  Vanzelotti           21
6      Júnior           28
7    Tadewald           20

### Filtragem por indexação (.iloc)

In [9]:
df.iloc[3]

Nome            Mateus
Sobrenome      Kienzle
Idade Atual         35
Name: 3, dtype: object

In [11]:
df.iloc[3:6]

      Nome   Sobrenome  Idade Atual
3   Mateus     Kienzle           35
4    Luiza   Cherobini           22
5  Rodrigo  Vanzelotti           21

In [13]:
df.iloc[3:, 0:1]

      Nome
3   Mateus
4    Luiza
5  Rodrigo
6    Ayres
7   Aninha

### Filtrando por condições (.loc)

In [15]:
df[df['Nome'] == 'Rodrigo'] # igual loc

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
5  Rodrigo  Vanzelotti           21

In [18]:
df.loc[df['Nome'] == 'Rodrigo']

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
5  Rodrigo  Vanzelotti           21

In [19]:
# c/ seleção de colunas
df[df['Nome'] == 'Rodrigo']['Sobrenome']

1      Tadewald
5    Vanzelotti
Name: Sobrenome, dtype: object

In [20]:
df.loc[df['Nome'] == 'Rodrigo', 'Sobrenome']

1      Tadewald
5    Vanzelotti
Name: Sobrenome, dtype: object

### Filtrando por múltiplas condições (.loc)

In [24]:
df.loc[(df['Nome'] =='Rodrigo') & (df['Idade Atual'] < 28)]

      Nome   Sobrenome  Idade Atual
5  Rodrigo  Vanzelotti           21

In [25]:
df.loc[(df['Nome'] =='Rodrigo') | (df['Nome'] =='Juliano')]

      Nome   Sobrenome  Idade Atual
1  Rodrigo    Tadewald           31
2  Juliano    Faccioni           25
5  Rodrigo  Vanzelotti           21

In [27]:
nomes_filtro = ['Adriano', 'Luiza']

df.loc[df['Nome'].isin(nomes_filtro)]

      Nome  Sobrenome  Idade Atual
0  Adriano     Soares           31
4    Luiza  Cherobini           22

In [29]:
df['Nome'].str.contains("Adriano")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: Nome, dtype: bool

In [28]:
df.loc[df['Nome'].str.contains('Adri')]

      Nome Sobrenome  Idade Atual
0  Adriano    Soares           31